public class lesson_09_17 {
    //Побитовый оператор NOT (НЕ, ОТРИЦАНИЕ)
    //Данный оператор очень похож на логический оператор NOT (НЕ), только обозначается уже не восклицательным знаком, а тильдой:

    //~a

    //Этот оператор унарный: применяется не к двум числам, а к одному, перед которым и ставится.
    //Побитовый NOT означает, что «результирующий бит равен единице, если бит числа a равен нулю,
    //и равен нулю, если бит числа a равен единице»:
    //~1 = 0
    //~0 = 1

    //Пример	Результат
    //~0b0011   0b1100
    //~0b0000   0b1111
    //~0b0101   0b1010
    //~0b1111   0b0000

    //Данный оператор просто меняет бит 1 на 0 и 0 на 1.
}
